Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <module name="SERCOM" id="U2201" version="1.1.0">
               <instance name="SERCOM0">
                  <register-group name="SERCOM0"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42000800"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA04"/>
                     <signal group="PAD" index="0" function="C" pad="PA08"/>
                     <signal group="PAD" index="1" function="D" pad="PA05"/>
                     <signal group="PAD" index="1" function="C" pad="PA09"/>
                     <signal group="PAD" index="2" function="D" pad="PA06"/>
                     <signal group="PAD" index="2" function="C" pad="PA10"/>
                     <signal group="PAD" index="3" function="D" pad="PA07"/>
                     <signal group="PAD" index="3" function="C" pad="PA11"/>
                  </signals>
                  <parameters>
                     <param name="GCLK_ID_CORE" value="13"/>
                     <param name="GCLK_ID_SLOW" value="12"/>
                     <param name="INT_MSB" value="3"/>
                     <param name="PMSB" value="3"/>
                     <param name="INSTANCE_ID" value="66"/>
                  </parameters>
               </instance>
               <instance name="SERCOM1">
                  <register-group name="SERCOM1"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42000C00"/>
                  <signals>
                     <signal group="PAD" index="0" function="C" pad="PA16"/>
                     <signal group="PAD" index="0" function="D" pad="PA00"/>
                     <signal group="PAD" index="1" function="C" pad="PA17"/>
                     <signal group="PAD" index="1" function="D" pad="PA01"/>
                     <signal group="PAD" index="2" function="D" pad="PA30"/>
                     <signal group="PAD" index="2" function="C" pad="PA18"/>
                     <signal group="PAD" index="3" function="D" pad="PA31"/>
                     <signal group="PAD" index="3" function="C" pad="PA19"/>
                  </signals>
                  <parameters>
                     <param name="GCLK_ID_CORE" value="14"/>
                     <param name="GCLK_ID_SLOW" value="12"/>
                     <param name="INT_MSB" value="3"/>
                     <param name="PMSB" value="3"/>
                     <param name="INSTANCE_ID" value="67"/>
                  </parameters>
               </instance>
               <instance name="SERCOM2">
                  <register-group name="SERCOM2"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001000"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA08"/>
                     <signal group="PAD" index="1" function="D" pad="PA09"/>
                     <signal group="PAD" index="2" function="D" pad="PA10"/>
                     <signal group="PAD" index="2" function="C" pad="PA14"/>
                     <signal group="PAD" index="3" function="D" pad="PA11"/>
                     <signal group="PAD" index="3" function="C" pad="PA15"/>
                  </signals>
                  <parameters>
                     <param name="GCLK_ID_CORE" value="15"/>
                     <param name="GCLK_ID_SLOW" value="12"/>
                     <param name="INT_MSB" value="3"/>
                     <param name="PMSB" value="3"/>
                     <param name="INSTANCE_ID" value="68"/>
                  </parameters>
               </instance>
               <instance name="SERCOM3">
                  <register-group name="SERCOM3"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001400"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA16"/>
                     <signal group="PAD" index="0" function="C" pad="PA22"/>
                     <signal group="PAD" index="1" function="D" pad="PA17"/>
                     <signal group="PAD" index="2" function="D" pad="PA18"/>
                     <signal group="PAD" index="3" function="D" pad="PA19"/>
                  </signals>
                  <parameters>
                     <param name="GCLK_ID_CORE" value="16"/>
                     <param name="GCLK_ID_SLOW" value="12"/>
                     <param name="INT_MSB" value="3"/>
                     <param name="PMSB" value="3"/>
                     <param name="INSTANCE_ID" value="69"/>
                  </parameters>
               </instance>
            </module>
            <module name="SYSCTRL" id="U2100" version="2.0.1">
               <instance name="SYSCTRL">
                  <register-group name="SYSCTRL"
                                  name-in-module="SYSCTRL"
                                  address-space="base"
                                  offset="0x40000800"/>
                  <signals>
                     <signal group="XIN" function="XIN" pad="PA14"/>
                     <signal group="XIN32" function="XIN32" pad="PA00"/>
                     <signal group="XOUT" function="XOUT" pad="PA15"/>
                     <signal group="XOUT32" function="XOUT32" pad="PA01"/>
                  </signals>
                  <parameters>
                     <param name="BGAP_CALIB_MSB" value="11"/>
                     <param name="BOD33_CALIB_MSB" value="5"/>
                     <param name="DFLL48M_COARSE_MSB" value="4"/>
                     <param name="DFLL48M_FINE_MSB" value="7"/>
                     <param name="GCLK_ID_DFLL48" value="0"/>
                     <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
                     <param name="POR33_ENTEST_MSB" value="1"/>
                     <param name="ULPVREF_DIVLEV_MSB" value="3"/>
                     <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
                     <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
                     <param name="VREF_CONTROL_MSB" value="48"/>
                     <param name="VREF_STATUS_MSB" value="7"/>
                     <param name="VREG_LEVEL_MSB" value="2"/>
                     <param name="BOD12_VERSION" value="0x112"/>
                     <param name="BOD33_VERSION" value="0x112"/>
                     <param name="DFLL48M_VERSION" value="0x211"/>
                     <param name="GCLK_VERSION" value="0x210"/>
                     <param name="OSCULP32K_VERSION" value="0x111"/>
                     <param name="OSC8M_VERSION" value="0x120"/>
                     <param name="OSC32K_VERSION" value="0x1101"/>
                     <param name="VREF_VERSION" value="0x200"/>
                     <param name="VREG_VERSION" value="0x201"/>
                     <param name="XOSC_VERSION" value="0x1101"/>
                     <param name="XOSC32K_VERSION" value="0x1101"/>
                     <param name="INSTANCE_ID" value="2"/>
                  </parameters>
               </instance>
            </module>
            <module name="TC" id="U2212" version="1.1.2">
               <instance name="TC0">
                  <register-group name="TC0"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42002000"/>
                  <signals>
                     <signal group="WO" index="0" function="F" pad="PA04"/>
                     <signal group="WO" index="0" function="E" pad="PA08"/>
                     <signal group="WO" index="1" function="F" pad="PA05"/>
                     <signal group="WO" index="1" function="E" pad="PA09"/>
                  </signals>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="19"/>
                     <param name="MASTER" value="1"/>
                     <param name="OW_NUM" value="2"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="72"/>
                  </parameters>
               </instance>
               <instance name="TC1">
                  <register-group name="TC1"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42002400"/>
                  <signals>
                     <signal group="WO" index="0" function="F" pad="PA06"/>
                     <signal group="WO" index="0" function="F" pad="PA30"/>
                     <signal group="WO" index="0" function="E" pad="PA10"/>
                     <signal group="WO" index="1" function="F" pad="PA07"/>
                     <signal group="WO" index="1" function="F" pad="PA31"/>
                     <signal group="WO" index="1" function="E" pad="PA11"/>
                  </signals>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="19"/>
                     <param name="MASTER" value="0"/>
                     <param name="OW_NUM" value="2"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="73"/>
                  </parameters>
               </instance>
               <instance name="TC2">
                  <register-group name="TC2"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42002800"/>
                  <signals>
                     <signal group="WO" index="0" function="F" pad="PA16"/>
                     <signal group="WO" index="0" function="F" pad="PA00"/>
                     <signal group="WO" index="1" function="F" pad="PA17"/>
                     <signal group="WO" index="1" function="F" pad="PA01"/>
                  </signals>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="20"/>
                     <param name="MASTER" value="1"/>
                     <param name="OW_NUM" value="2"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="74"/>
                  </parameters>
               </instance>
               <instance name="TC3">
                  <register-group name="TC3"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42002C00"/>
                  <signals>
                     <signal group="WO" index="0" function="F" pad="PA18"/>
                     <signal group="WO" index="0" function="E" pad="PA14"/>
                     <signal group="WO" index="1" function="F" pad="PA19"/>
                     <signal group="WO" index="1" function="E" pad="PA15"/>
                  </signals>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="20"/>
                     <param name="MASTER" value="0"/>
                     <param name="OW_NUM" value="2"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="75"/>
                  </parameters>
               </instance>
