Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="WINUT"
                      offset="0x20"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Window Monitor Upper Threshold">
               <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFF"/>
            </register>
            <register name="GAINCORR"
                      offset="0x24"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Gain Correction">
               <bitfield name="GAINCORR" caption="Gain Correction Value" mask="0xFFF"/>
            </register>
            <register name="OFFSETCORR"
                      offset="0x26"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Offset Correction">
               <bitfield name="OFFSETCORR" caption="Offset Correction Value" mask="0xFFF"/>
            </register>
            <register name="CALIB"
                      offset="0x28"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Calibration">
               <bitfield name="LINEARITY_CAL"
                         caption="Linearity Calibration Value"
                         mask="0xFF"/>
               <bitfield name="BIAS_CAL" caption="Bias Calibration Value" mask="0x700"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x2A"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
            </register>
         </register-group>
         <value-group name="ADC_REFCTRL__REFSEL">
            <value name="INT1V" caption="1.0V voltage reference" value="0"/>
            <value name="INTVCC0" caption="1/1.48 VDDANA" value="1"/>
            <value name="INTVCC1"
                   caption="1/2 VDDANA (only for VDDANA &gt; 2.0V)"
                   value="2"/>
            <value name="AREFA" caption="External reference A" value="3"/>
            <value name="AREFB" caption="External reference B" value="4"/>
         </value-group>
         <value-group name="ADC_AVGCTRL__SAMPLENUM">
            <value name="1" caption="1 sample" value="0"/>
            <value name="2" caption="2 samples" value="1"/>
            <value name="4" caption="4 samples" value="2"/>
            <value name="8" caption="8 samples" value="3"/>
            <value name="16" caption="16 samples" value="4"/>
            <value name="32" caption="32 samples" value="5"/>
            <value name="64" caption="64 samples" value="6"/>
            <value name="128" caption="128 samples" value="7"/>
            <value name="256" caption="256 samples" value="8"/>
            <value name="512" caption="512 samples" value="9"/>
            <value name="1024" caption="1024 samples" value="10"/>
         </value-group>
         <value-group name="ADC_CTRLB__PRESCALER">
            <value name="DIV4" caption="Peripheral clock divided by 4" value="0"/>
            <value name="DIV8" caption="Peripheral clock divided by 8" value="1"/>
            <value name="DIV16" caption="Peripheral clock divided by 16" value="2"/>
            <value name="DIV32" caption="Peripheral clock divided by 32" value="3"/>
            <value name="DIV64" caption="Peripheral clock divided by 64" value="4"/>
            <value name="DIV128" caption="Peripheral clock divided by 128" value="5"/>
            <value name="DIV256" caption="Peripheral clock divided by 256" value="6"/>
            <value name="DIV512" caption="Peripheral clock divided by 512" value="7"/>
         </value-group>
         <value-group name="ADC_CTRLB__RESSEL">
            <value name="12BIT" caption="12-bit result" value="0"/>
            <value name="16BIT" caption="16-bit averaging mode" value="1"/>
            <value name="10BIT" caption="10-bit result" value="2"/>
            <value name="8BIT" caption="8-bit result" value="3"/>
         </value-group>
         <value-group name="ADC_WINCTRL__WINMODE">
            <value name="DISABLE" caption="No window mode (default)" value="0"/>
            <value name="MODE1" caption="Mode 1: RESULT &gt; WINLT" value="1"/>
            <value name="MODE2" caption="Mode 2: RESULT &lt; WINUT" value="2"/>
            <value name="MODE3" caption="Mode 3: WINLT &lt; RESULT &lt; WINUT" value="3"/>
            <value name="MODE4" caption="Mode 4: !(WINLT &lt; RESULT &lt; WINUT)" value="4"/>
         </value-group>
         <value-group name="ADC_INPUTCTRL__GAIN">
            <value name="1X" caption="1x" value="0"/>
            <value name="2X" caption="2x" value="1"/>
            <value name="4X" caption="4x" value="2"/>
            <value name="8X" caption="8x" value="3"/>
            <value name="16X" caption="16x" value="4"/>
            <value name="DIV2" caption="1/2x" value="15"/>
         </value-group>
         <value-group name="ADC_INPUTCTRL__MUXNEG">
            <value name="PIN0" caption="ADC AIN0 Pin" value="0"/>
            <value name="PIN1" caption="ADC AIN1 Pin" value="1"/>
            <value name="PIN2" caption="ADC AIN2 Pin" value="2"/>
            <value name="PIN3" caption="ADC AIN3 Pin" value="3"/>
            <value name="PIN4" caption="ADC AIN4 Pin" value="4"/>
            <value name="PIN5" caption="ADC AIN5 Pin" value="5"/>
            <value name="PIN6" caption="ADC AIN6 Pin" value="6"/>
            <value name="PIN7" caption="ADC AIN7 Pin" value="7"/>
            <value name="GND" caption="Internal ground" value="24"/>
            <value name="IOGND" caption="IO ground" value="25"/>
         </value-group>
         <value-group name="ADC_INPUTCTRL__MUXPOS">
            <value name="PIN0" caption="ADC AIN0 Pin" value="0"/>
            <value name="PIN1" caption="ADC AIN1 Pin" value="1"/>
            <value name="PIN2" caption="ADC AIN2 Pin" value="2"/>
            <value name="PIN3" caption="ADC AIN3 Pin" value="3"/>
            <value name="PIN4" caption="ADC AIN4 Pin" value="4"/>
            <value name="PIN5" caption="ADC AIN5 Pin" value="5"/>
            <value name="PIN6" caption="ADC AIN6 Pin" value="6"/>
            <value name="PIN7" caption="ADC AIN7 Pin" value="7"/>
            <value name="PIN8" caption="ADC AIN8 Pin" value="8"/>
            <value name="PIN9" caption="ADC AIN9 Pin" value="9"/>
            <value name="PIN10" caption="ADC AIN10 Pin" value="10"/>
            <value name="PIN11" caption="ADC AIN11 Pin" value="11"/>
            <value name="PIN12" caption="ADC AIN12 Pin" value="12"/>
            <value name="PIN13" caption="ADC AIN13 Pin" value="13"/>
            <value name="PIN14" caption="ADC AIN14 Pin" value="14"/>
            <value name="PIN15" caption="ADC AIN15 Pin" value="15"/>
            <value name="PIN16" caption="ADC AIN16 Pin" value="16"/>
            <value name="PIN17" caption="ADC AIN17 Pin" value="17"/>
            <value name="PIN18" caption="ADC AIN18 Pin" value="18"/>
            <value name="PIN19" caption="ADC AIN19 Pin" value="19"/>
            <value name="TEMP" caption="Temperature Reference" value="24"/>
            <value name="BANDGAP" caption="Bandgap Voltage" value="25"/>
            <value name="SCALEDCOREVCC" caption="1/4  Scaled Core Supply" value="26"/>
            <value name="SCALEDIOVCC" caption="1/4  Scaled I/O Supply" value="27"/>
            <value name="DAC" caption="DAC Output" value="28"/>
         </value-group>
      </module>
