Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
      <module name="DAC"
              id="U2214"
              version="1.0.1"
              caption="Digital Analog Converter">
         <register-group name="DAC" caption="Digital Analog Converter">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
            </register>
            <register name="CTRLB"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control B">
               <bitfield name="EOEN" caption="External Output Enable" mask="0x1"/>
               <bitfield name="IOEN" caption="Internal Output Enable" mask="0x2"/>
               <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x4"/>
               <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x8"/>
               <bitfield name="REFSEL"
                         caption="Reference Selection"
                         mask="0xC0"
                         values="DAC_CTRLB__REFSEL"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="STARTEI" caption="Start Conversion Event Input" mask="0x1"/>
               <bitfield name="EMPTYEO" caption="Data Buffer Empty Event Output" mask="0x2"/>
            </register>
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
               <bitfield name="EMPTY"
                         caption="Data Buffer Empty Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
               <bitfield name="EMPTY"
                         caption="Data Buffer Empty Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="UNDERRUN" caption="Underrun" mask="0x1"/>
               <bitfield name="EMPTY" caption="Data Buffer Empty" mask="0x2"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x4"/>
            </register>
            <register name="STATUS"
                      offset="0x7"
                      rw="R"
                      access="RSYNC"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy Status" mask="0x80"/>
            </register>
            <register name="DATA"
                      offset="0x8"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Data">
               <bitfield name="DATA" caption="Data to be converted" mask="0xFFFF"/>
            </register>
            <register name="DATABUF"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Data Buffer">
               <bitfield name="DATABUF" caption="Data Buffer" mask="0xFFFF"/>
            </register>
         </register-group>
         <value-group name="DAC_CTRLB__REFSEL">
            <value name="INT1V" caption="Internal 1.0V reference" value="0"/>
            <value name="AVCC" caption="AVCC" value="1"/>
            <value name="VREFP" caption="External reference" value="2"/>
         </value-group>
      </module>
      <module name="DSU"
              id="U2209"
              version="1.0.3"
              caption="Device Service Unit">
         <register-group name="DSU" caption="Device Service Unit">
            <register name="CTRL"
                      offset="0x0"
                      rw="W"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
               <bitfield name="MBIST" caption="Memory built-in self-test" mask="0x8"/>
               <bitfield name="CE" caption="Chip-Erase" mask="0x10"/>
               <bitfield name="ARR" caption="Auxiliary Row Read" mask="0x40"/>
               <bitfield name="SMSA" caption="Start Memory Stream Access" mask="0x80"/>
            </register>
            <register name="STATUSA"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Status A">
               <bitfield name="DONE" caption="Done" mask="0x1"/>
               <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
               <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
               <bitfield name="FAIL" caption="Failure" mask="0x8"/>
               <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
            </register>
            <register name="STATUSB"
                      offset="0x2"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status B">
               <bitfield name="PROT" caption="Protected" mask="0x1"/>
               <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
               <bitfield name="DCCD0"
                         caption="Debug Communication Channel 0 Dirty"
                         mask="0x4"/>
               <bitfield name="DCCD1"
                         caption="Debug Communication Channel 1 Dirty"
                         mask="0x8"/>
               <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
            </register>
            <register name="ADDR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Address">
               <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
               <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
            </register>
            <register name="LENGTH"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Length">
               <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
            </register>
            <register name="DATA"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Data">
               <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
            </register>
