Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="CID2"
                      offset="0x1FF8"
                      rw="R"
                      size="4"
                      initval="0x00000005"
                      caption="Component Identification 2">
               <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
            </register>
            <register name="CID3"
                      offset="0x1FFC"
                      rw="R"
                      size="4"
                      initval="0x000000B1"
                      caption="Component Identification 3">
               <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
            </register>
         </register-group>
         <value-group name="DSU_DID__FAMILY">
            <value name="0" caption="General purpose microcontroller" value="0"/>
            <value name="1" caption="PicoPower" value="1"/>
         </value-group>
         <value-group name="DSU_DID__PROCESSOR">
            <value name="0" caption="Cortex-M0" value="0"/>
            <value name="1" caption="Cortex-M0+" value="1"/>
            <value name="2" caption="Cortex-M3" value="2"/>
            <value name="3" caption="Cortex-M4" value="3"/>
         </value-group>
         <value-group name="DSU_DID__SERIES">
            <value name="0"
                   caption="Cortex-M0+ processor, basic feature set"
                   value="0"/>
            <value name="1" caption="Cortex-M0+ processor, USB" value="1"/>
         </value-group>
      </module>
      <module name="EIC"
              id="U2217"
              version="1.0.1"
              caption="External Interrupt Controller">
         <register-group name="EIC" caption="External Interrupt Controller">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
            </register>
            <register name="STATUS"
                      offset="0x1"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="NMICTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Non-Maskable Interrupt Control">
               <bitfield name="NMISENSE"
                         caption="Non-Maskable Interrupt Sense"
                         mask="0x7"
                         values="EIC_NMICTRL__NMISENSE"/>
               <bitfield name="NMIFILTEN"
                         caption="Non-Maskable Interrupt Filter Enable"
                         mask="0x8"/>
            </register>
            <register name="NMIFLAG"
                      offset="0x3"
                      rw="RW"
                      size="1"
                      atomic-op="clear:NMIFLAG"
                      initval="0x00"
                      caption="Non-Maskable Interrupt Flag Status and Clear">
               <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
            </register>
            <register name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Event Control">
               <bitfield name="EXTINTEO0"
                         caption="External Interrupt 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="EXTINTEO1"
                         caption="External Interrupt 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="EXTINTEO2"
                         caption="External Interrupt 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="EXTINTEO3"
                         caption="External Interrupt 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="EXTINTEO4"
                         caption="External Interrupt 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="EXTINTEO5"
                         caption="External Interrupt 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="EXTINTEO6"
                         caption="External Interrupt 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="EXTINTEO7"
                         caption="External Interrupt 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="EXTINTEO8"
                         caption="External Interrupt 8 Event Output Enable"
                         mask="0x100"/>
               <bitfield name="EXTINTEO9"
                         caption="External Interrupt 9 Event Output Enable"
                         mask="0x200"/>
               <bitfield name="EXTINTEO10"
                         caption="External Interrupt 10 Event Output Enable"
                         mask="0x400"/>
               <bitfield name="EXTINTEO11"
                         caption="External Interrupt 11 Event Output Enable"
                         mask="0x800"/>
               <bitfield name="EXTINTEO12"
                         caption="External Interrupt 12 Event Output Enable"
                         mask="0x1000"/>
               <bitfield name="EXTINTEO13"
                         caption="External Interrupt 13 Event Output Enable"
                         mask="0x2000"/>
               <bitfield name="EXTINTEO14"
                         caption="External Interrupt 14 Event Output Enable"
                         mask="0x4000"/>
               <bitfield name="EXTINTEO15"
                         caption="External Interrupt 15 Event Output Enable"
                         mask="0x8000"/>
            </register>
