Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
               <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
               <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
               <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
               <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
               <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
               <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
               <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
               <bitfield name="EXTINT8" caption="External Interrupt 8 Enable" mask="0x100"/>
               <bitfield name="EXTINT9" caption="External Interrupt 9 Enable" mask="0x200"/>
               <bitfield name="EXTINT10" caption="External Interrupt 10 Enable" mask="0x400"/>
               <bitfield name="EXTINT11" caption="External Interrupt 11 Enable" mask="0x800"/>
               <bitfield name="EXTINT12"
                         caption="External Interrupt 12 Enable"
                         mask="0x1000"/>
               <bitfield name="EXTINT13"
                         caption="External Interrupt 13 Enable"
                         mask="0x2000"/>
               <bitfield name="EXTINT14"
                         caption="External Interrupt 14 Enable"
                         mask="0x4000"/>
               <bitfield name="EXTINT15"
                         caption="External Interrupt 15 Enable"
                         mask="0x8000"/>
            </register>
            <register name="INTENSET"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
               <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
               <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
               <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
               <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
               <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
               <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
               <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
               <bitfield name="EXTINT8" caption="External Interrupt 8 Enable" mask="0x100"/>
               <bitfield name="EXTINT9" caption="External Interrupt 9 Enable" mask="0x200"/>
               <bitfield name="EXTINT10" caption="External Interrupt 10 Enable" mask="0x400"/>
               <bitfield name="EXTINT11" caption="External Interrupt 11 Enable" mask="0x800"/>
               <bitfield name="EXTINT12"
                         caption="External Interrupt 12 Enable"
                         mask="0x1000"/>
               <bitfield name="EXTINT13"
                         caption="External Interrupt 13 Enable"
                         mask="0x2000"/>
               <bitfield name="EXTINT14"
                         caption="External Interrupt 14 Enable"
                         mask="0x4000"/>
               <bitfield name="EXTINT15"
                         caption="External Interrupt 15 Enable"
                         mask="0x8000"/>
            </register>
            <register name="INTFLAG"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="EXTINT0" caption="External Interrupt 0" mask="0x1"/>
               <bitfield name="EXTINT1" caption="External Interrupt 1" mask="0x2"/>
               <bitfield name="EXTINT2" caption="External Interrupt 2" mask="0x4"/>
               <bitfield name="EXTINT3" caption="External Interrupt 3" mask="0x8"/>
               <bitfield name="EXTINT4" caption="External Interrupt 4" mask="0x10"/>
               <bitfield name="EXTINT5" caption="External Interrupt 5" mask="0x20"/>
               <bitfield name="EXTINT6" caption="External Interrupt 6" mask="0x40"/>
               <bitfield name="EXTINT7" caption="External Interrupt 7" mask="0x80"/>
               <bitfield name="EXTINT8" caption="External Interrupt 8" mask="0x100"/>
               <bitfield name="EXTINT9" caption="External Interrupt 9" mask="0x200"/>
               <bitfield name="EXTINT10" caption="External Interrupt 10" mask="0x400"/>
               <bitfield name="EXTINT11" caption="External Interrupt 11" mask="0x800"/>
               <bitfield name="EXTINT12" caption="External Interrupt 12" mask="0x1000"/>
               <bitfield name="EXTINT13" caption="External Interrupt 13" mask="0x2000"/>
               <bitfield name="EXTINT14" caption="External Interrupt 14" mask="0x4000"/>
               <bitfield name="EXTINT15" caption="External Interrupt 15" mask="0x8000"/>
            </register>
            <register name="WAKEUP"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Wake-Up Enable">
               <bitfield name="WAKEUPEN0"
                         caption="External Interrupt 0 Wake-up Enable"
                         mask="0x1"/>
               <bitfield name="WAKEUPEN1"
                         caption="External Interrupt 1 Wake-up Enable"
                         mask="0x2"/>
               <bitfield name="WAKEUPEN2"
                         caption="External Interrupt 2 Wake-up Enable"
                         mask="0x4"/>
               <bitfield name="WAKEUPEN3"
                         caption="External Interrupt 3 Wake-up Enable"
                         mask="0x8"/>
               <bitfield name="WAKEUPEN4"
                         caption="External Interrupt 4 Wake-up Enable"
                         mask="0x10"/>
               <bitfield name="WAKEUPEN5"
                         caption="External Interrupt 5 Wake-up Enable"
                         mask="0x20"/>
               <bitfield name="WAKEUPEN6"
                         caption="External Interrupt 6 Wake-up Enable"
                         mask="0x40"/>
               <bitfield name="WAKEUPEN7"
                         caption="External Interrupt 7 Wake-up Enable"
                         mask="0x80"/>
               <bitfield name="WAKEUPEN8"
                         caption="External Interrupt 8 Wake-up Enable"
                         mask="0x100"/>
               <bitfield name="WAKEUPEN9"
                         caption="External Interrupt 9 Wake-up Enable"
                         mask="0x200"/>
               <bitfield name="WAKEUPEN10"
                         caption="External Interrupt 10 Wake-up Enable"
                         mask="0x400"/>
               <bitfield name="WAKEUPEN11"
                         caption="External Interrupt 11 Wake-up Enable"
                         mask="0x800"/>
               <bitfield name="WAKEUPEN12"
                         caption="External Interrupt 12 Wake-up Enable"
                         mask="0x1000"/>
               <bitfield name="WAKEUPEN13"
                         caption="External Interrupt 13 Wake-up Enable"
                         mask="0x2000"/>
               <bitfield name="WAKEUPEN14"
                         caption="External Interrupt 14 Wake-up Enable"
                         mask="0x4000"/>
               <bitfield name="WAKEUPEN15"
                         caption="External Interrupt 15 Wake-up Enable"
                         mask="0x8000"/>
            </register>
