Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="CONFIG"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="Configuration n">
               <bitfield name="SENSE0"
                         caption="Input Sense 0 Configuration"
                         mask="0x7"
                         values="EIC_CONFIG__SENSE0"/>
               <bitfield name="FILTEN0" caption="Filter 0 Enable" mask="0x8"/>
               <bitfield name="SENSE1"
                         caption="Input Sense 1 Configuration"
                         mask="0x70"
                         values="EIC_CONFIG__SENSE1"/>
               <bitfield name="FILTEN1" caption="Filter 1 Enable" mask="0x80"/>
               <bitfield name="SENSE2"
                         caption="Input Sense 2 Configuration"
                         mask="0x700"
                         values="EIC_CONFIG__SENSE2"/>
               <bitfield name="FILTEN2" caption="Filter 2 Enable" mask="0x800"/>
               <bitfield name="SENSE3"
                         caption="Input Sense 3 Configuration"
                         mask="0x7000"
                         values="EIC_CONFIG__SENSE3"/>
               <bitfield name="FILTEN3" caption="Filter 3 Enable" mask="0x8000"/>
               <bitfield name="SENSE4"
                         caption="Input Sense 4 Configuration"
                         mask="0x70000"
                         values="EIC_CONFIG__SENSE4"/>
               <bitfield name="FILTEN4" caption="Filter 4 Enable" mask="0x80000"/>
               <bitfield name="SENSE5"
                         caption="Input Sense 5 Configuration"
                         mask="0x700000"
                         values="EIC_CONFIG__SENSE5"/>
               <bitfield name="FILTEN5" caption="Filter 5 Enable" mask="0x800000"/>
               <bitfield name="SENSE6"
                         caption="Input Sense 6 Configuration"
                         mask="0x7000000"
                         values="EIC_CONFIG__SENSE6"/>
               <bitfield name="FILTEN6" caption="Filter 6 Enable" mask="0x8000000"/>
               <bitfield name="SENSE7"
                         caption="Input Sense 7 Configuration"
                         mask="0x70000000"
                         values="EIC_CONFIG__SENSE7"/>
               <bitfield name="FILTEN7" caption="Filter 7 Enable" mask="0x80000000"/>
            </register>
         </register-group>
         <value-group name="EIC_NMICTRL__NMISENSE">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising-edge detection" value="1"/>
            <value name="FALL" caption="Falling-edge detection" value="2"/>
            <value name="BOTH" caption="Both-edges detection" value="3"/>
            <value name="HIGH" caption="High-level detection" value="4"/>
            <value name="LOW" caption="Low-level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE0">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising-edge detection" value="1"/>
            <value name="FALL" caption="Falling-edge detection" value="2"/>
            <value name="BOTH" caption="Both-edges detection" value="3"/>
            <value name="HIGH" caption="High-level detection" value="4"/>
            <value name="LOW" caption="Low-level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE1">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE2">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE3">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE4">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE5">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE6">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE7">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
      </module>
      <module name="EVSYS"
              id="U2208"
              version="1.0.1"
              caption="Event System Interface">
         <register-group name="EVSYS" caption="Event System Interface">
            <register name="CTRL"
                      offset="0x0"
                      rw="W"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="GCLKREQ" caption="Generic Clock Requests" mask="0x10"/>
            </register>
            <register name="CHANNEL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Channel">
               <bitfield name="CHANNEL" caption="Channel Selection" mask="0x7"/>
               <bitfield name="SWEVT" caption="Software Event" mask="0x100"/>
               <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x3F0000"/>
               <bitfield name="PATH"
                         caption="Path Selection"
                         mask="0x3000000"
                         values="EVSYS_CHANNEL__PATH"/>
               <bitfield name="EDGSEL"
                         caption="Edge Detection Selection"
                         mask="0xC000000"
                         values="EVSYS_CHANNEL__EDGSEL"/>
            </register>
            <register name="USER"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="User Multiplexer">
               <bitfield name="USER" caption="User Multiplexer Selection" mask="0xF"/>
               <bitfield name="CHANNEL"
                         caption="Channel Event Selection"
                         mask="0xF00"
                         values="EVSYS_USER__CHANNEL"/>
            </register>
