Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="CLKCTRL"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Generic Clock Control">
               <bitfield name="ID"
                         caption="Generic Clock Selection ID"
                         mask="0x3F"
                         values="GCLK_CLKCTRL__ID"/>
               <bitfield name="GEN"
                         caption="Generic Clock Generator"
                         mask="0xF00"
                         values="GCLK_CLKCTRL__GEN"/>
               <bitfield name="CLKEN" caption="Clock Enable" mask="0x4000"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
            </register>
            <register name="GENCTRL"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Generic Clock Generator Control">
               <bitfield name="ID"
                         caption="Generic Clock Generator Selection"
                         mask="0xF"
                         values="GCLK_GENCTRL__ID"/>
               <bitfield name="SRC"
                         caption="Source Select"
                         mask="0x1F00"
                         values="GCLK_GENCTRL__SRC"/>
               <bitfield name="GENEN"
                         caption="Generic Clock Generator Enable"
                         mask="0x10000"/>
               <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x20000"/>
               <bitfield name="OOV" caption="Output Off Value" mask="0x40000"/>
               <bitfield name="OE" caption="Output Enable" mask="0x80000"/>
               <bitfield name="DIVSEL"
                         caption="Divide Selection"
                         mask="0x100000"
                         values="GCLK_GENCTRL__DIVSEL"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x200000"/>
            </register>
            <register name="GENDIV"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Generic Clock Generator Division">
               <bitfield name="ID"
                         caption="Generic Clock Generator Selection"
                         mask="0xF"
                         values="GCLK_GENDIV__ID"/>
               <bitfield name="DIV" caption="Division Factor" mask="0xFFFF00"/>
            </register>
         </register-group>
         <value-group name="GCLK_CLKCTRL__GEN">
            <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
            <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
            <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
            <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
            <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
            <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
            <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
            <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
         </value-group>
         <value-group name="GCLK_CLKCTRL__ID">
            <value name="DFLL48M" caption="DFLL48M Reference" value="0x0"/>
            <value name="WDT" caption="WDT" value="0x1"/>
            <value name="RTC" caption="RTC" value="0x2"/>
            <value name="EIC" caption="EIC" value="0x3"/>
            <value name="EVSYS_CHANNEL_0" caption="EVSYS_CHANNEL_0" value="0x4"/>
            <value name="EVSYS_CHANNEL_1" caption="EVSYS_CHANNEL_1" value="0x5"/>
            <value name="EVSYS_CHANNEL_2" caption="EVSYS_CHANNEL_2" value="0x6"/>
            <value name="EVSYS_CHANNEL_3" caption="EVSYS_CHANNEL_3" value="0x7"/>
            <value name="EVSYS_CHANNEL_4" caption="EVSYS_CHANNEL_4" value="0x8"/>
            <value name="EVSYS_CHANNEL_5" caption="EVSYS_CHANNEL_5" value="0x9"/>
            <value name="EVSYS_CHANNEL_6" caption="EVSYS_CHANNEL_6" value="0xA"/>
            <value name="EVSYS_CHANNEL_7" caption="EVSYS_CHANNEL_7" value="0xB"/>
            <value name="SERCOMX_SLOW" caption="SERCOMx_SLOW" value="0xC"/>
            <value name="SERCOM0_CORE" caption="SERCOM0_CORE" value="0xD"/>
            <value name="SERCOM1_CORE" caption="SERCOM1_CORE" value="0xE"/>
            <value name="SERCOM2_CORE" caption="SERCOM2_CORE" value="0xF"/>
            <value name="SERCOM3_CORE" caption="SERCOM3_CORE" value="0x10"/>
            <value name="SERCOM4_CORE" caption="SERCOM4_CORE" value="0x11"/>
            <value name="SERCOM5_CORE" caption="SERCOM5_CORE" value="0x12"/>
            <value name="TC0_TC1" caption="TC0,TC1" value="0x13"/>
            <value name="TC2_TC3" caption="TC2,TC3" value="0x14"/>
            <value name="TC4_TC5" caption="TC4,TC5" value="0x15"/>
            <value name="TC6_TC7" caption="TC6,TC7" value="0x16"/>
            <value name="ADC" caption="ADC" value="0x17"/>
            <value name="AC_DIG" caption="AC_DIG" value="0x18"/>
            <value name="AC_ANA" caption="AC_ANA" value="0x19"/>
            <value name="DAC" caption="DAC" value="0x1A"/>
         </value-group>
         <value-group name="GCLK_GENCTRL__ID">
            <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
            <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
            <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
            <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
            <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
            <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
            <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
            <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
         </value-group>
         <value-group name="GCLK_GENCTRL__SRC">
            <value name="XOSC" caption="XOSC oscillator output" value="0"/>
            <value name="GCLKIN" caption="Generator input pad" value="1"/>
            <value name="GCLKGEN1"
                   caption="Generic clock generator 1 output"
                   value="2"/>
            <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
            <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
            <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
            <value name="OSC8M" caption="OSC8M oscillator output" value="6"/>
            <value name="DFLL48M" caption="DFLL48M output" value="7"/>
         </value-group>
         <value-group name="GCLK_GENDIV__ID">
            <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
            <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
            <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
            <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
            <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
            <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
            <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
            <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
         </value-group>
         <value-group name="GCLK_GENCTRL__DIVSEL">
            <value name="DIV1"
                   caption="Divide input directly by divider factor"
                   value="0x0"/>
            <value name="DIV2"
                   caption="Divide input by 2^(divider factor+ 1)"
                   value="0x1"/>
         </value-group>
      </module>
      <module name="NVMCTRL"
              id="U2207"
              version="1.0.9"
              caption="Non-Volatile Memory Controller">
         <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Control A">
               <bitfield name="CMD"
                         caption="Command"
                         mask="0x7F"
                         values="NVMCTRL_CTRLA__CMD"/>
               <bitfield name="CMDEX"
                         caption="Command Execution"
                         mask="0xFF00"
                         values="NVMCTRL_CTRLA__CMDEX"/>
            </register>
            <register name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control B">
               <bitfield name="RWS"
                         caption="NVM Read Wait States"
                         mask="0x1E"
                         values="NVMCTRL_CTRLB__RWS"/>
               <bitfield name="MANW" caption="Manual Write" mask="0x80"/>
               <bitfield name="SLEEPPRM"
                         caption="Power Reduction Mode during Sleep"
                         mask="0x300"
                         values="NVMCTRL_CTRLB__SLEEPPRM"/>
               <bitfield name="READMODE"
                         caption="NVMCTRL Read Mode"
                         mask="0x30000"
                         values="NVMCTRL_CTRLB__READMODE"/>
               <bitfield name="CACHEDIS" caption="Cache Disable" mask="0x40000"/>
            </register>
            <register name="PARAM"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="NVM Parameter">
               <bitfield name="NVMP" caption="NVM Pages" mask="0xFFFF"/>
               <bitfield name="PSZ"
                         caption="Page Size"
                         mask="0x70000"
                         values="NVMCTRL_PARAM__PSZ"/>
            </register>
