Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register modes="I2CM"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Control B">
               <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
               <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200"/>
               <bitfield name="CMD" caption="Command" mask="0x30000"/>
               <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
            </register>
            <register modes="I2CS"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Control B">
               <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
               <bitfield name="AMODE" caption="Address Mode" mask="0xC000"/>
               <bitfield name="CMD" caption="Command" mask="0x30000"/>
               <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
            </register>
            <register modes="SPIM"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_SPIM_CTRLB__CHSIZE"/>
               <bitfield name="PLOADEN" caption="Slave Data Preload Enable" mask="0x40"/>
               <bitfield name="AMODE"
                         caption="Address Mode"
                         mask="0xC000"
                         values="SERCOM_SPIM_CTRLB__AMODE"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="SPIS"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_SPIM_CTRLB__CHSIZE"/>
               <bitfield name="PLOADEN" caption="Slave Data Preload Enable" mask="0x40"/>
               <bitfield name="AMODE"
                         caption="Address Mode"
                         mask="0xC000"
                         values="SERCOM_SPIM_CTRLB__AMODE"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="USART_EXT"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_USART_CTRLB__CHSIZE"/>
               <bitfield name="SBMODE"
                         caption="Stop Bit Mode"
                         mask="0x40"
                         values="SERCOM_USART_CTRLB__SBMODE"/>
               <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
               <bitfield name="PMODE"
                         caption="Parity Mode"
                         mask="0x2000"
                         values="SERCOM_USART_CTRLB__PMODE"/>
               <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="USART_INT"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_USART_CTRLB__CHSIZE"/>
               <bitfield name="SBMODE"
                         caption="Stop Bit Mode"
                         mask="0x40"
                         values="SERCOM_USART_CTRLB__SBMODE"/>
               <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
               <bitfield name="PMODE"
                         caption="Parity Mode"
                         mask="0x2000"
                         values="SERCOM_USART_CTRLB__PMODE"/>
               <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="I2CM"
                      name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="I2CM Debug Control">
               <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
            </register>
            <register modes="SPIM"
                      name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIM Debug Control">
               <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
            </register>
            <register modes="SPIS"
                      name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIS Debug Control">
               <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
            </register>
            <register modes="USART_EXT"
                      name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_EXT Debug Control">
               <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
            </register>
            <register modes="USART_INT"
                      name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_INT Debug Control">
               <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
            </register>
