Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register modes="I2CM"
                      name="BAUD"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CM Baud Rate">
               <bitfield name="BAUD" caption="Master Baud Rate" mask="0xFF"/>
               <bitfield name="BAUDLOW" caption="Master Baud Rate Low" mask="0xFF00"/>
            </register>
            <register modes="SPIM"
                      name="BAUD"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIM Baud Rate">
               <bitfield name="BAUD" caption="Baud Register" mask="0xFF"/>
            </register>
            <register modes="SPIS"
                      name="BAUD"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIS Baud Rate">
               <bitfield name="BAUD" caption="Baud Register" mask="0xFF"/>
            </register>
            <register modes="USART_EXT"
                      name="BAUD"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Baud">
               <bitfield name="BAUD" caption="Baud Value" mask="0xFFFF"/>
            </register>
            <register modes="USART_INT"
                      name="BAUD"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Baud">
               <bitfield name="BAUD" caption="Baud Value" mask="0xFFFF"/>
            </register>
            <register modes="I2CM"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CM Interrupt Enable Clear">
               <bitfield name="MB" caption="Master on Bus Interrupt Enable" mask="0x1"/>
               <bitfield name="SB" caption="Slave on Bus Interrupt Enable" mask="0x2"/>
            </register>
            <register modes="I2CS"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CS Interrupt Enable Clear">
               <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="SPIM"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIM Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="SPIS"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIS Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="USART_EXT"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_EXT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
            </register>
            <register modes="USART_INT"
                      name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_INT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
            </register>
            <register modes="I2CM"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="I2CM Interrupt Enable Set">
               <bitfield name="MB" caption="Master on Bus Interrupt Enable" mask="0x1"/>
               <bitfield name="SB" caption="Slave on Bus Interrupt Enable" mask="0x2"/>
            </register>
            <register modes="I2CS"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="I2CS Interrupt Enable Set">
               <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="SPIM"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="SPIM Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="SPIS"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="SPIS Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
            </register>
            <register modes="USART_EXT"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="USART_EXT Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
            </register>
            <register modes="USART_INT"
                      name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="USART_INT Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
            </register>
