Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register modes="I2CM"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="I2CM Interrupt Flag Status and Clear">
               <bitfield name="MB" caption="Master on Bus" mask="0x1"/>
               <bitfield name="SB" caption="Slave on Bus" mask="0x2"/>
            </register>
            <register modes="I2CS"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="I2CS Interrupt Flag Status and Clear">
               <bitfield name="PREC" caption="Stop Received" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Ready" mask="0x4"/>
            </register>
            <register modes="SPIM"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="SPIM Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
            </register>
            <register modes="SPIS"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="SPIS Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
            </register>
            <register modes="USART_EXT"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="USART_EXT Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
            </register>
            <register modes="USART_INT"
                      name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="USART_INT Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
            </register>
            <register modes="I2CM"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="I2CM Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="ARBLOST" caption="Arbitration Lost" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="BUSSTATE" caption="Bus State" mask="0x30"/>
               <bitfield name="LOWTOUT" caption="SCL Low Time-out" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
            <register modes="I2CS"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="I2CS Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="COLL" caption="Transmit Collision" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="DIR" caption="Read / Write Direction" mask="0x8"/>
               <bitfield name="SR" caption="Repeated Start" mask="0x10"/>
               <bitfield name="LOWTOUT" caption="SCL Low Time-out" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
            <register modes="SPIM"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIM Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
            <register modes="SPIS"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIS Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
            <register modes="USART_EXT"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
            <register modes="USART_INT"
                      name="STATUS"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
            </register>
