Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
         <value-group name="SERCOM_SPIM_CTRLA__CPOL">
            <value name="IDLE_LOW" caption="SCK is low when idle" value="0x0"/>
            <value name="IDLE_HIGH" caption="SCK is high when idle" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DORD">
            <value name="MSB" caption="MSB is transferred first" value="0x0"/>
            <value name="LSB" caption="LSB is transferred first" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DOPO">
            <value name="PAD0"
                   caption="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]"
                   value="0x0"/>
            <value name="PAD1"
                   caption="DO on PAD[2], SCK on PAD[3] and SS on PAD[1]"
                   value="0x1"/>
            <value name="PAD2"
                   caption="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]"
                   value="0x2"/>
            <value name="PAD3"
                   caption="DO on PAD[0], SCK on PAD[3] and SS on PAD[1]"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DIPO">
            <value name="PAD0" caption="SERCOM PAD[0]" value="0x0"/>
            <value name="PAD1" caption="SERCOM PAD[1]" value="0x1"/>
            <value name="PAD2" caption="SERCOM PAD[2]" value="0x2"/>
            <value name="PAD3" caption="SERCOM PAD[3]" value="0x3"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__FORM">
            <value name="SPI_FRAME" caption="SPI Frame" value="0x0"/>
            <value name="SPI_FRAME_WITH_ADDR"
                   caption="SPI Frame with Addr"
                   value="0x2"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLB__CHSIZE">
            <value name="8_BIT" caption="8 bits" value="0x0"/>
            <value name="9_BIT" caption="9 bits" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLB__AMODE">
            <value name="MASK"
                   caption="ADDRMASK is used as a mask to the ADDR register."
                   value="0x0"/>
            <value name="2_ADDRESSES"
                   caption="The slave responds to the 2 unique addresses in ADDR and ADDRMASK."
                   value="0x1"/>
            <value name="RANGE"
                   caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit."
                   value="0x2"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__MODE">
            <value name="USART_EXT_CLK"
                   caption="USART with external clock"
                   value="0x0"/>
            <value name="USART_INT_CLK"
                   caption="USART with internal clock"
                   value="0x1"/>
            <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
            <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
            <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
            <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__CMODE">
            <value name="ASYNC" caption="Asynchronous Communication" value="0x0"/>
            <value name="SYNC" caption="Synchronous Communication" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__CPOL">
            <value name="IDLE_LOW"
                   caption="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge"
                   value="0x0"/>
            <value name="IDLE_HIGH"
                   caption="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge"
                   value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__DORD">
            <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
            <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__FORM">
            <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
            <value name="USART_FRAME_WITH_PARITY"
                   caption="USART frame with parity"
                   value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__RXPO">
            <value name="PAD0"
                   caption="SERCOM PAD[0] is used for data reception"
                   value="0x0"/>
            <value name="PAD1"
                   caption="SERCOM PAD[1] is used for data reception"
                   value="0x1"/>
            <value name="PAD2"
                   caption="SERCOM PAD[2] is used for data reception"
                   value="0x2"/>
            <value name="PAD3"
                   caption="SERCOM PAD[3] is used for data reception"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__TXPO">
            <value name="PAD0" caption="PAD[0] = TxD; PAD[1] = XCK" value="0x0"/>
            <value name="PAD1" caption="PAD[2] = TxD; PAD[3] = XCK" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__CHSIZE">
            <value name="8_BIT" caption="8 Bits" value="0x0"/>
            <value name="9_BIT" caption="9 Bits" value="0x1"/>
            <value name="5_BIT" caption="5 Bits" value="0x5"/>
            <value name="6_BIT" caption="6 Bits" value="0x6"/>
            <value name="7_BIT" caption="7 Bits" value="0x7"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__PMODE">
            <value name="EVEN" caption="Even Parity" value="0x0"/>
            <value name="ODD" caption="Odd Parity" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__SBMODE">
            <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
            <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
         </value-group>
      </module>
      <module name="SYSCTRL"
              id="U2100"
              version="2.0.1"
              caption="System Control">
         <register-group name="SYSCTRL" caption="System Control">
            <register name="INTENCLR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
            </register>
            <register name="INTENSET"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
            </register>
            <register name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
            </register>
            <register name="PCLKSR"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Power and Clocks Status">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
            </register>
            <register name="XOSC"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0080"
                      caption="External Multipurpose Crystal Oscillator (XOSC) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="GAIN"
                         caption="Oscillator Gain"
                         mask="0x700"
                         values="SYSCTRL_XOSC__GAIN"/>
               <bitfield name="AMPGC"
                         caption="Automatic Amplitude Gain Control"
                         mask="0x800"/>
               <bitfield name="STARTUP"
                         caption="Start-Up Time"
                         mask="0xF000"
                         values="SYSCTRL_XOSC__STARTUP"/>
            </register>
            <register name="XOSC32K"
                      offset="0x14"
                      rw="RW"
                      size="2"
                      initval="0x0080"
                      caption="32kHz External Crystal Oscillator (XOSC32K) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
               <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
               <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
               <bitfield name="AAMPEN"
                         caption="Automatic Amplitude Control Enable"
                         mask="0x20"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="STARTUP"
                         caption="Oscillator Start-Up Time"
                         mask="0x700"
                         values="SYSCTRL_XOSC32K__STARTUP"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
            </register>
            <register name="OSC32K"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x003F0080"
                      caption="32kHz Internal Oscillator (OSC32K) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
               <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="STARTUP"
                         caption="Oscillator Start-Up Time"
                         mask="0x700"
                         values="SYSCTRL_OSC32K__STARTUP"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
               <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
            </register>
            <register name="OSCULP32K"
                      offset="0x1C"
                      rw="RW"
                      size="1"
                      initval="0x0F"
                      caption="OSCULP32K Control">
               <bitfield name="CALIB" caption="Calibration Value" mask="0x1F"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
            </register>
            <register name="OSC8M"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x87070382"
                      caption="8MHz Internal Oscillator (OSC8M) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="PRESC"
                         caption="Oscillator Prescaler"
                         mask="0x300"
                         values="SYSCTRL_OSC8M__PRESC"/>
               <bitfield name="CALIB" caption="Oscillator Calibration" mask="0xFFF0000"/>
               <bitfield name="FRANGE"
                         caption="Oscillator Frequency Range"
                         mask="0xC0000000"
                         values="SYSCTRL_OSC8M__FRANGE"/>
            </register>
            <register name="DFLLCTRL"
                      offset="0x24"
                      rw="RW"
                      size="2"
                      initval="0x0080"
                      caption="DFLL Config">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE" caption="Mode Selection" mask="0x4"/>
               <bitfield name="STABLE" caption="Stable Frequency" mask="0x8"/>
               <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
               <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
               <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
            </register>
