Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
         <value-group name="SUPC_BODVDD__ACTION">
            <value name="NONE" caption="No action" value="0x0"/>
            <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
            <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
         </value-group>
         <value-group name="SUPC_BODVDD__PSEL">
            <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
            <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
            <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
            <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
            <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
            <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
            <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
            <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
            <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
            <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
            <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
            <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
            <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
            <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
            <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
            <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
         </value-group>
      </module>
      <module name="TC"
              id="U2212"
              version="1.1.2"
              caption="Basic Timer Counter">
         <register-group name="TC" caption="Basic Timer Counter">
            <mode name="COUNT8"
                  qualifier="TC.CTRLA.MODE"
                  value="1"
                  caption="8-bit Counter Mode"/>
            <mode name="COUNT16"
                  qualifier="TC.CTRLA.MODE"
                  value="0"
                  caption="16-bit Counter Mode"/>
            <mode name="COUNT32"
                  qualifier="TC.CTRLA.MODE"
                  value="2"
                  caption="32-bit Counter Mode"/>
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="TC Mode"
                         mask="0xC"
                         values="TC_CTRLA__MODE"/>
               <bitfield name="WAVEGEN"
                         caption="Waveform Generation Operation"
                         mask="0x60"
                         values="TC_CTRLA__WAVEGEN"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0x700"
                         values="TC_CTRLA__PRESCALER"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
               <bitfield name="PRESCSYNC"
                         caption="Prescaler and Counter Synchronization"
                         mask="0x3000"
                         values="TC_CTRLA__PRESCSYNC"/>
            </register>
            <register name="READREQ"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Read Request">
               <bitfield name="ADDR" caption="Address" mask="0x1F"/>
               <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
               <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
            </register>
            <register name="CTRLBCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CTRLBCLR"
                      initval="0x02"
                      caption="Control B Clear">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xC0"
                         values="TC_CTRLBCLR__CMD"/>
            </register>
            <register name="CTRLBSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:CTRLBSET"
                      initval="0x00"
                      caption="Control B Set">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="ONESHOT" caption="One-shot" mask="0x4"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xC0"
                         values="TC_CTRLBSET__CMD"/>
            </register>
            <register name="CTRLC"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control C">
               <bitfield name="INVEN0" caption="Output Waveform 0 Invert Enable" mask="0x1"/>
               <bitfield name="INVEN1" caption="Output Waveform 1 Invert Enable" mask="0x2"/>
               <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x10"/>
               <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x20"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run Mode" mask="0x1"/>
            </register>
            <register name="EVCTRL"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Event Control">
               <bitfield name="EVACT"
                         caption="Event Action"
                         mask="0x7"
                         values="TC_EVCTRL__EVACT"/>
               <bitfield name="TCINV" caption="TC Inverted Event Input" mask="0x10"/>
               <bitfield name="TCEI" caption="TC Event Input" mask="0x20"/>
               <bitfield name="OVFEO"
                         caption="Overflow/Underflow Event Output Enable"
                         mask="0x100"/>
               <bitfield name="MCEO0"
                         caption="Match or Capture Channel 0 Event Output Enable"
                         mask="0x1000"/>
               <bitfield name="MCEO1"
                         caption="Match or Capture Channel 1 Event Output Enable"
                         mask="0x2000"/>
            </register>
