Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20"/>
            </register>
            <register name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20"/>
            </register>
            <register name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="OVF" caption="Overflow" mask="0x1"/>
               <bitfield name="ERR" caption="Error" mask="0x2"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x8"/>
               <bitfield name="MC0" caption="Match or Capture Channel 0" mask="0x10"/>
               <bitfield name="MC1" caption="Match or Capture Channel 1" mask="0x20"/>
            </register>
            <register name="STATUS"
                      offset="0xF"
                      rw="R"
                      size="1"
                      initval="0x08"
                      caption="Status">
               <bitfield name="STOP" caption="Stop" mask="0x8"/>
               <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register modes="COUNT8"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="COUNT8 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFF"/>
            </register>
            <register modes="COUNT16"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="COUNT16 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
            </register>
            <register modes="COUNT32"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="COUNT32 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="COUNT8"
                      name="PER"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      initval="0xFF"
                      caption="COUNT8 Period Value">
               <bitfield name="PER" caption="Period Value" mask="0xFF"/>
            </register>
            <register modes="COUNT8"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      count="2"
                      initval="0x00"
                      caption="COUNT8 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFF"/>
            </register>
            <register modes="COUNT16"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="COUNT16 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFFFF"/>
            </register>
            <register modes="COUNT32"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="COUNT32 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="TC_CTRLA__MODE">
            <value name="COUNT16" caption="Counter in 16-bit mode" value="0"/>
            <value name="COUNT8" caption="Counter in 8-bit mode" value="1"/>
            <value name="COUNT32" caption="Counter in 32-bit mode" value="2"/>
         </value-group>
         <value-group name="TC_CTRLA__PRESCALER">
            <value name="DIV1" caption="GCLK_TC" value="0"/>
            <value name="DIV2" caption="GCLK_TC/2" value="1"/>
            <value name="DIV4" caption="GCLK_TC/4" value="2"/>
            <value name="DIV8" caption="GCLK_TC/8" value="3"/>
            <value name="DIV16" caption="GCLK_TC/16" value="4"/>
            <value name="DIV64" caption="GCLK_TC/64" value="5"/>
            <value name="DIV256" caption="GCLK_TC/256" value="6"/>
            <value name="DIV1024" caption="GCLK_TC/1024" value="7"/>
         </value-group>
