Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E16BU.atdf
            <register name="DFSR"
                      offset="0xD30"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Debug Fault Status Register">
               <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
               <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
               <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
               <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
               <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
            </register>
         </register-group>
         <value-group name="SystemControl_ICSR__NMIPENDSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: NMI exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes NMI exception state to pending; read: NMI exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSTCLR">
            <value name="VALUE_0" caption="No effect" value="0"/>
            <value name="VALUE_1"
                   caption="Removes the pending state from the SysTick exception"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSTSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: SysTick exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSVCLR">
            <value name="VALUE_0" caption="No effect" value="0"/>
            <value name="VALUE_1"
                   caption="Removes the pending state from the PendSV exception"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSVSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: PendSV exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_AIRCR__ENDIANNESS">
            <value name="VALUE_0" caption="Little-endian" value="0"/>
            <value name="VALUE_1" caption="Big-endian" value="1"/>
         </value-group>
         <value-group name="SystemControl_AIRCR__SYSRESETREQ">
            <value name="VALUE_0" caption="No system reset request" value="0"/>
            <value name="VALUE_1"
                   caption="Asserts a signal to the outer system that requests a reset"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SEVONPEND">
            <value name="VALUE_0"
                   caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SLEEPDEEP">
            <value name="VALUE_0" caption="Sleep" value="0"/>
            <value name="VALUE_1" caption="Deep sleep" value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SLEEPONEXIT">
            <value name="VALUE_0"
                   caption="O not sleep when returning to Thread mode"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Enter sleep, or deep sleep, on return from an ISR"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_CCR__STKALIGN">
            <value name="VALUE_0" caption="4-byte aligned" value="0"/>
            <value name="VALUE_1" caption="8-byte aligned" value="1"/>
         </value-group>
         <value-group name="SystemControl_CCR__UNALIGN_TRP">
            <value name="VALUE_0"
                   caption="Do not trap unaligned halfword and word accesses"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Trap unaligned halfword and word accesses"
                   value="1"/>
         </value-group>
      </module>
   </modules>
   <pinouts>
      <pinout name="SAMD20EU" caption="SAMD20EU">
         <pin position="A1" pad="PA00"/>
         <pin position="B2" pad="PA01"/>
         <pin position="A3" pad="PA02"/>
         <pin position="B4" pad="PA03"/>
         <pin position="A5" pad="PA04"/>
         <pin position="A7" pad="PA05"/>
         <pin position="A9" pad="PA06"/>
         <pin position="B6" pad="PA07"/>
         <pin position="B8" pad="VDDANA"/>
         <pin position="C5" pad="GNDIO"/>
         <pin position="C7" pad="PA08"/>
         <pin position="C9" pad="PA09"/>
         <pin position="D8" pad="PA10"/>
         <pin position="D6" pad="PA11"/>
         <pin position="E9" pad="PA14"/>
         <pin position="E7" pad="PA15"/>
         <pin position="F8" pad="PA16"/>
         <pin position="E5" pad="PA17"/>
         <pin position="F6" pad="PA18"/>
         <pin position="F4" pad="PA19"/>
         <pin position="E3" pad="PA22"/>
         <pin position="F2" pad="RESET_N"/>
         <pin position="E1" pad="PA28"/>
         <pin position="D2" pad="VDDCORE"/>
         <pin position="C1" pad="VDDIN"/>
         <pin position="C3" pad="PA30"/>
         <pin position="D4" pad="PA31"/>
      </pinout>
   </pinouts>
</avr-tools-device-file>
